---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSet.GetMembers
source: html/6190ec28-6fa3-439e-3d32-11f5f330d819.htm
---
# Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSet.GetMembers Method

Gets member element ids for the mechanical equipment set.

## Syntax (C#)
```csharp
public ISet<ElementId> GetMembers()
```

## Returns
Element ids for the members in the mechanical equipment set.